Revit 2026 API

# DialogBoxData Methods

---

The DialogBoxData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | OverrideResult | Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DialogBoxData Class

Autodesk.Revit.UI.Events Namespace